app/Controllers/Customer.php

    public function listCustomers()
    {
        $mc = new ModelCustomers();
        return $this->respond(['data' => $mc->select('*')->where('aktif', '1')->orderBy('name', 'ASC')->findAll()]);
---
SELECT *
FROM `customers`
WHERE `aktif` = '1'
ORDER BY `name` ASC

    public function cariCustomers($kataPencarian)
    {
        $mc = new ModelCustomers();
        return $this->respond(['data' => $mc->select('*')->where('aktif', '1')->like('name', $kataPencarian)->orderBy('name', 'ASC')->findAll()]);
---
SELECT *
FROM `customers`
WHERE `aktif` = '1'
AND  `name` LIKE '%tes%' ESCAPE '!'
ORDER BY `name` ASC