app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `user_id` = 'alyusman'
OR `email` = 'alyusman'
 LIMIT 1
---
    public function index()
    {
        helper(['form']); // Load the form helper

        $rules = [
            'username' => 'required|min_length[3]|max_length[50]',
            'password' => 'required|min_length[4]',
        ];

        if (!$this->validate($rules)) return $this->fail($this->validator->getErrors(), 409);

        $mu = new ModelUsers();
        $json = $this->request->getJSON();
        $username = $json->username;
        try {
            $user = $mu->select('*')->where('user_id', $username)->orWhere('email', $username)->first();