app/Models/ModelVisits.php

    public function byUserToDay($user_id)
    {
        $db = $this->db->table('visits v');
        $db->select('v.customer_id, v.latitude, v.longitude, photo_path, v.visit_date, v.notes, v.synced, v.created_at, v.updated_at, c.name');
        $db->join('customers c', 'v.customer_id=c.id', 'left');
        $db->where([ 'user_id' => $user_id, 'v.visit_date' => date('Y-m-d')]);
        $db->orderBy('v.created_at', 'DESC');
        $data = $db->get();
---
SELECT `v`.`customer_id`, `v`.`latitude`, `v`.`longitude`, `photo_path`, `v`.`visit_date`, `v`.`notes`, `v`.`synced`, `v`.`created_at`, `v`.`updated_at`, `c`.`name`
FROM `visits` `v`
LEFT JOIN `customers` `c` ON `v`.`customer_id`=`c`.`id`
WHERE `user_id` = '96830a27-04a3-11f1-b66e-1a13a891ef7a'
AND `v`.`visit_date` = '2026-02-09'
ORDER BY `v`.`created_at` DESC